# Group Type Id Toposolid Subdivision Property

Source: https://www.revitapidocs.com/2026/62f7584c-175b-0aa4-d1a2-97f9520e3ff6.htm

---

| Group Type Id Toposolid Subdivision Property |
| --- |

Sub\-division.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ToposolidSubdivision { get; }
```

```
Public Shared ReadOnly Property ToposolidSubdivision As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ToposolidSubdivision {
	ForgeTypeId^ get ();
}
```

```
static member ToposolidSubdivision : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

GroupTypeId Class Autodesk.Revit.DB Namespace